## INTEGRATING SQL AND PYTHON

In the below  notebook we will be trying to integrate python and mysql data base where we will be creating a database and a table named PYTHON and add data to the table and actually query data using SQL  commands while here in jupyter notebooks, we will also add data whhile still here in jupyter notebooks and analsyze the data using complex and simple commands (lets call it advanced sql)

In the below lines of  code we will be connecting and initiating sql in jupyter notebooks  we will need to install some libraries

#### pip install mysql-connector-python
 it is advisable to install the dependencieds from the terminal to save on time and then refresh the jupyter notebook

import mysql.connector: This line imports the mysql.connector module, which is a Python library used for connecting to and interacting with MySQL databases.

from mysql.connector import Error: This line specifically imports the Error class from the mysql.connector module. The Error class is used to handle exceptions and errors that may occur during database operations.

import pandas as pd: This line imports the Pandas library and gives it an alias pd. Pandas is a powerful library for data manipulation and analysis in Python. By convention, it is often imported as pd to make the code more concise

In [2]:

import mysql.connector
from mysql.connector import Error
import pandas as pd

import mysql.connector and from mysql.connector import Error: These lines import the necessary modules for working with MySQL databases and handling potential errors using the mysql.connector library.

def create_server_connection(host_name, user_name, user_password):: This line defines a function named create_server_connection that takes three parameters: host_name, user_name, and user_password. This function is intended to create a connection to a MySQL database server.

Inside the create_server_connection function:

connection = None: Initializes a variable named connection to None. This variable will store the database connection object.
A try block is used to attempt to establish a connection to the MySQL database server using the provided host_name, user_name, and user_password. If the connection is successful, it prints a success message; otherwise, it catches any errors that occur and prints an error message.
The mysql.connector.connect() function is used to create a connection object with the provided host, username, and password.
pw = "1Leviticus." and db = "python": These lines define two variables, pw and db, which store the MySQL user password and the name of the database you want to connect to, respectively.

connection = create_server_connection("localhost", "root", pw): This line calls the create_server_connection function with the arguments "localhost" (the MySQL server hostname), "root" (the MySQL username), and the pw variable (the MySQL user password). It attempts to establish a connection to the MySQL database server using the provided information and stores the connection object in the connection variable.

Overall, this code sets up a function to create a connection to a MySQL database server and then demonstrates its usage by connecting to a local MySQL server with the root user and a password stored in the pw variable. If the connection is successful, it prints a success message, and the connection variable holds the database connection object, which can be used for executing database queries.

In [4]:
import mysql.connector
from mysql.connector import Error

def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password
        )
        print('MySQL database connection was successful')
    except Error as err:
        print(f"Error: {err}")
    return connection

pw = "1Leviticus."
db = "python"
connection = create_server_connection("localhost", "root", pw)

MySQL database connection was successful

*import mysql.connector and from mysql.connector import Error:* These lines import the necessary modules for working with MySQL databases and handling potential errors using the mysql.connector library, just like in the previous example.

def create_database(connection, query):: This line defines a new function named create_database that takes two parameters: connection and query. This function is intended to execute a SQL query to create a new database on the MySQL server.

Inside the create_database function:

cursor = connection.cursor(): Creates a cursor object associated with the provided connection. A cursor is used to execute SQL queries against the database.
A try block is used to attempt to execute the provided SQL query (query) using the cursor. If the execution is successful, it prints a success message; otherwise, it catches any errors that occur and prints an error message.
create_database_query = "CREATE DATABASE python": This line defines a variable create_database_query with the SQL query to create a new database named "python." The SQL query is in uppercase as it's conventionally written that way.

connection = create_server_connection("localhost", "root", pw): This line calls the create_server_connection function (defined earlier) to establish a connection to the MySQL server with the specified hostname, username ("root"), and password (pw).

create_database(connection, create_database_query): This line calls the create_database function with two arguments: the connection object (established in the previous step) and the create_database_query containing the SQL query to create a new database. This will attempt to create a database named "python" on the MySQL server.

In [6]:
import mysql.connector
from mysql.connector import Error

def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print(f"Error: {err}")

create_database_query = "CREATE DATABASE python"  # Use uppercase "CREATE DATABASE"
connection = create_server_connection("localhost", "root", pw)  # Assuming you have defined pw earlier
create_database(connection, create_database_query)

MySQL database connection was successful
Database created successfully

import mysql.connector and from mysql.connector import Error: These lines import the necessary modules for working with MySQL databases and handling potential errors using the mysql.connector library, as seen in previous examples.

def create_db_connection(host_name, user_name, user_password, db_name):: This line defines a function called create_db_connection. This function takes four parameters: host_name, user_name, user_password, and db_name. It is designed to create a connection to a MySQL database with the provided information.

Inside the create_db_connection function:

connection = None: Initializes a variable named connection to None. This variable will store the database connection object.
A try block is used to attempt to establish a connection to the MySQL database server with the provided host_name, user_name, user_password, and db_name. If the connection is successful, it prints a success message; otherwise, it catches any errors that occur and prints an error message.
The mysql.connector.connect() function is used to create a connection object with the provided host, username, password, and the specific database (db_name) to which you want to connect.
Usage:

host_name = "localhost", user_name = "root", user_password = "1Leviticus.", and db_name = "python": These lines define variables containing the values for the MySQL server hostname, username, password, and the name of the database to connect to.

connection = create_db_connection(host_name, user_name, user_password, db_name): This line calls the create_db_connection function with the specified parameters, attempting to establish a connection to the MySQL server using the provided details. If successful, it assigns the connection object to the connection variable.

Overall, this code sets up a function for creating a connection to a specific MySQL database, allowing you to connect to a database with the specified hostname, username, password, and database name. It's a useful way to encapsulate the connection logic, making it easier to manage database connections in your Python code.

In [21]:
import mysql.connector
from mysql.connector import Error

def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password,
            database=db_name
        )
        print("MySQL database connection was successful")
    except Error as err:
        print(f"Error: {err}")
    return connection

# Usage
host_name = "localhost"
user_name = "root"
user_password = "1Leviticus."
db_name = "python"
connection = create_db_connection(host_name, user_name, user_password, db_name)

MySQL database connection was successful

def execute_query(connection, query):: This line defines the execute_query function, which accepts two parameters: connection (a database connection object) and query (a string containing the SQL query to execute).

Inside the execute_query function:

cursor = connection.cursor(): Creates a cursor object associated with the provided database connection. A cursor is used to execute SQL queries.

A try block is used to attempt to execute the provided SQL query (query) using the cursor. If the execution is successful, it commits the changes made by the query (if any) to the database and prints a success message; otherwise, it catches any errors that occur and prints an error message.

cursor.execute(query): Executes the SQL query using the cursor.
connection.commit(): Commits the changes made by the query to the database. This is necessary for INSERT, UPDATE, DELETE, and some other queries that modify data.
In case of a successful query execution, it prints "query was successful."

In case of an error during query execution, it catches the Error exception (defined earlier in the code) and prints an error message that includes the specific error details.

You can use this execute_query function to execute SQL queries on a connected database conveniently, encapsulating the execution logic and error handling in a single function. For example, you could call this function with a database connection and an SQL query to insert data, update records, or retrieve data from the database.

In [20]:
def execute_query(connection,query):
    cursor=connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("query was succesful")
    except Error as err:
        print(f"Error: '{err}'")

In [13]:
#we will be creating a table where then we will add data into the table

create_orders_table="""
create table orders(
order_id int primary key,
customer_name varchar(30)not null,
product_name varchar(20)not null,
date_ordered date ,
quantity int,
unit_price float,
phone_number varchar(20)
)

"""
connection=create_db_connection("localhost","root",pw,db)
execute_query(connection,create_orders_table)

MySQL database connection was successful
query was succesful

In [17]:
data_orders="""
insert into orders values

(1, 'John Doe', 'Widget A', '2023-09-10', 5, 10.99, '555-555-5555'),
(2, 'Jane Smith', 'Widget B', '2023-09-11', 3, 15.49, '555-555-5556'),
(3, 'Bob Johnson', 'Widget C', '2023-09-12', 10, 8.99, '555-555-5557'),
(4, 'Alice Brown', 'Widget A', '2023-09-13', 7, 10.99, '555-555-5558'),
(5, 'Ella Davis', 'Widget D', '2023-09-14', 2, 19.99, '555-555-5559'),
(6, 'David Lee', 'Widget B', '2023-09-15', 4, 15.49, '555-555-5560'),
(7, 'Grace Wilson', 'Widget C', '2023-09-16', 8, 8.99, '555-555-5561'),
(8, 'Sam White', 'Widget A', '2023-09-17', 1, 10.99, '555-555-5562'),
(9, 'Olivia Turner', 'Widget D', '2023-09-18', 6, 19.99, '555-555-5563'),
(10, 'Sophia Harris', 'Widget B', '2023-09-19', 3, 15.49, '555-555-5564'),
(11, 'Lucas Clark', 'Widget C', '2023-09-20', 9, 8.99, '555-555-5565'),
(12, 'Liam Martin', 'Widget A', '2023-09-21', 5, 10.99, '555-555-5566'),
(13, 'Mia Turner', 'Widget D', '2023-09-22', 2, 19.99, '555-555-5567'),
(14, 'Ava Garcia', 'Widget B', '2023-09-23', 4, 15.49, '555-555-5568'),
(15, 'Noah Jackson', 'Widget C', '2023-09-24', 7, 8.99, '555-555-5569'),
(16, 'Emma Wilson', 'Widget A', '2023-09-25', 3, 10.99, '555-555-5570'),
(17, 'Oliver Smith', 'Widget D', '2023-09-26', 5, 19.99, '555-555-5571'),
(18, 'Lily Johnson', 'Widget B', '2023-09-27', 6, 15.49, '555-555-5572'),
(19, 'Charlotte Brown', 'Widget C', '2023-09-28', 4, 8.99, '555-555-5573'),
(20, 'James Davis', 'Widget A', '2023-09-29', 2, 10.99, '555-555-5574');
"""
connection=create_db_connection('localhost',"root",pw,db)
execute_query(connection,data_orders)

MySQL database connection was successful
query was succesful

def read_query(connection, query):: This line defines the read_query function, which takes two parameters: connection (a database connection object) and query (a string containing the SQL query to execute).

Inside the read_query function:

cursor = connection.cursor(): Creates a cursor object associated with the provided database connection. The cursor is used to execute SQL queries and retrieve results from the database.

result = None: Initializes a variable named result to None. This variable will store the results of the query if it's successful.

A try block is used to attempt to execute the provided SQL query (query) using the cursor. If the execution is successful, it:

Executes the query using cursor.execute(query).
Retrieves the results of the query using cursor.fetchall() and assigns them to the result variable.
Returns the result variable, which contains the query results.
If there is an error during query execution, the except block catches the Error exception (defined earlier in the code). It prints an error message that includes the specific error details but does not return any results.

In case of a successful query execution, the function returns the query results stored in the result variable.

In case of an error during query execution, it catches the Error exception, prints an error message that includes the specific error details, and does not return any results.

You can use this read_query function to execute SELECT queries on a connected database and retrieve the results as a list of tuples. This function encapsulates the execution and result retrieval logic, making it convenient for querying databases and handling errors.

In [18]:
def read_query(connection,query):
    cursor=connection.cursor()
    result =None
    try:
        cursor.execute(query)
        result=cursor.fetchall()
        return result
    except Error as err:
        print(f"Error:'{err}'")

### we will sampling the dataset where we will be selecting all the datapoints using select all statement

In [23]:
q1=""" 
select * from orders;
""" 
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q1)
for result in results:
    print(result)

MySQL database connection was successful
(1, 'John Doe', 'Widget A', datetime.date(2023, 9, 10), 5, 10.99, '555-555-5555')
(2, 'Jane Smith', 'Widget B', datetime.date(2023, 9, 11), 3, 15.49, '555-555-5556')
(3, 'Bob Johnson', 'Widget C', datetime.date(2023, 9, 12), 10, 8.99, '555-555-5557')
(4, 'Alice Brown', 'Widget A', datetime.date(2023, 9, 13), 7, 10.99, '555-555-5558')
(5, 'Ella Davis', 'Widget D', datetime.date(2023, 9, 14), 2, 19.99, '555-555-5559')
(6, 'David Lee', 'Widget B', datetime.date(2023, 9, 15), 4, 15.49, '555-555-5560')
(7, 'Grace Wilson', 'Widget C', datetime.date(2023, 9, 16), 8, 8.99, '555-555-5561')
(8, 'Sam White', 'Widget A', datetime.date(2023, 9, 17), 1, 10.99, '555-555-5562')
(9, 'Olivia Turner', 'Widget D', datetime.date(2023, 9, 18), 6, 19.99, '555-555-5563')
(10, 'Sophia Harris', 'Widget B', datetime.date(2023, 9, 19), 3, 15.49, '555-555-5564')
(11, 'Lucas Clark', 'Widget C', datetime.date(2023, 9, 20), 9, 8.99, '555-555-5565')
(12, 'Liam Martin', 'Widget A', datetime.date(2023, 9, 21), 5, 10.99, '555-555-5566')
(13, 'Mia Turner', 'Widget D', datetime.date(2023, 9, 22), 2, 19.99, '555-555-5567')
(14, 'Ava Garcia', 'Widget B', datetime.date(2023, 9, 23), 4, 15.49, '555-555-5568')
(15, 'Noah Jackson', 'Widget C', datetime.date(2023, 9, 24), 7, 8.99, '555-555-5569')
(16, 'Emma Wilson', 'Widget A', datetime.date(2023, 9, 25), 3, 10.99, '555-555-5570')
(17, 'Oliver Smith', 'Widget D', datetime.date(2023, 9, 26), 5, 19.99, '555-555-5571')
(18, 'Lily Johnson', 'Widget B', datetime.date(2023, 9, 27), 6, 15.49, '555-555-5572')
(19, 'Charlotte Brown', 'Widget C', datetime.date(2023, 9, 28), 4, 8.99, '555-555-5573')
(20, 'James Davis', 'Widget A', datetime.date(2023, 9, 29), 2, 10.99, '555-555-5574')

### we will obtaining  the customer_name,phone-number only as the columns

In [26]:
q2=""" 
select  customer_name,phone_number from orders;
""" 
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q2)
for result in results:
    print(result)

MySQL database connection was successful
('John Doe', '555-555-5555')
('Jane Smith', '555-555-5556')
('Bob Johnson', '555-555-5557')
('Alice Brown', '555-555-5558')
('Ella Davis', '555-555-5559')
('David Lee', '555-555-5560')
('Grace Wilson', '555-555-5561')
('Sam White', '555-555-5562')
('Olivia Turner', '555-555-5563')
('Sophia Harris', '555-555-5564')
('Lucas Clark', '555-555-5565')
('Liam Martin', '555-555-5566')
('Mia Turner', '555-555-5567')
('Ava Garcia', '555-555-5568')
('Noah Jackson', '555-555-5569')
('Emma Wilson', '555-555-5570')
('Oliver Smith', '555-555-5571')
('Lily Johnson', '555-555-5572')
('Charlotte Brown', '555-555-5573')
('James Davis', '555-555-5574')

### we will be obtaining the list of years where orders

In [27]:
q3=""" 
select  year(date_ordered) from orders;
""" 
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q3)
for result in results:
    print(result)

MySQL database connection was successful
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)
(2023,)

### We wiill be obtaining the dinstict years columns

In [29]:
q4=""" 
select distinct year(date_ordered) from orders;
""" 
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q4)
for result in results:
    print(result)

MySQL database connection was successful
(2023,)

### commands to access data from a a particular data

In [34]:
q5=""" 
select * from orders where date_ordered < '2023-09-20' ;
""" 
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q5)
for result in results:
    print(result)

MySQL database connection was successful
(1, 'John Doe', 'Widget A', datetime.date(2023, 9, 10), 5, 10.99, '555-555-5555')
(2, 'Jane Smith', 'Widget B', datetime.date(2023, 9, 11), 3, 15.49, '555-555-5556')
(3, 'Bob Johnson', 'Widget C', datetime.date(2023, 9, 12), 10, 8.99, '555-555-5557')
(4, 'Alice Brown', 'Widget A', datetime.date(2023, 9, 13), 7, 10.99, '555-555-5558')
(5, 'Ella Davis', 'Widget D', datetime.date(2023, 9, 14), 2, 19.99, '555-555-5559')
(6, 'David Lee', 'Widget B', datetime.date(2023, 9, 15), 4, 15.49, '555-555-5560')
(7, 'Grace Wilson', 'Widget C', datetime.date(2023, 9, 16), 8, 8.99, '555-555-5561')
(8, 'Sam White', 'Widget A', datetime.date(2023, 9, 17), 1, 10.99, '555-555-5562')
(9, 'Olivia Turner', 'Widget D', datetime.date(2023, 9, 18), 6, 19.99, '555-555-5563')
(10, 'Sophia Harris', 'Widget B', datetime.date(2023, 9, 19), 3, 15.49, '555-555-5564')

In [35]:
q6=""" 
select * from orders where date_ordered > '2023-09-20' ;
""" 
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q6)
for result in results:
    print(result)

MySQL database connection was successful
(12, 'Liam Martin', 'Widget A', datetime.date(2023, 9, 21), 5, 10.99, '555-555-5566')
(13, 'Mia Turner', 'Widget D', datetime.date(2023, 9, 22), 2, 19.99, '555-555-5567')
(14, 'Ava Garcia', 'Widget B', datetime.date(2023, 9, 23), 4, 15.49, '555-555-5568')
(15, 'Noah Jackson', 'Widget C', datetime.date(2023, 9, 24), 7, 8.99, '555-555-5569')
(16, 'Emma Wilson', 'Widget A', datetime.date(2023, 9, 25), 3, 10.99, '555-555-5570')
(17, 'Oliver Smith', 'Widget D', datetime.date(2023, 9, 26), 5, 19.99, '555-555-5571')
(18, 'Lily Johnson', 'Widget B', datetime.date(2023, 9, 27), 6, 15.49, '555-555-5572')
(19, 'Charlotte Brown', 'Widget C', datetime.date(2023, 9, 28), 4, 8.99, '555-555-5573')
(20, 'James Davis', 'Widget A', datetime.date(2023, 9, 29), 2, 10.99, '555-555-5574')

### using the order by column

In [36]:
q7=""" 
select * from orders  order by unit_price;
""" 
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q7)
for result in results:
    print(result)

MySQL database connection was successful
(3, 'Bob Johnson', 'Widget C', datetime.date(2023, 9, 12), 10, 8.99, '555-555-5557')
(7, 'Grace Wilson', 'Widget C', datetime.date(2023, 9, 16), 8, 8.99, '555-555-5561')
(11, 'Lucas Clark', 'Widget C', datetime.date(2023, 9, 20), 9, 8.99, '555-555-5565')
(15, 'Noah Jackson', 'Widget C', datetime.date(2023, 9, 24), 7, 8.99, '555-555-5569')
(19, 'Charlotte Brown', 'Widget C', datetime.date(2023, 9, 28), 4, 8.99, '555-555-5573')
(1, 'John Doe', 'Widget A', datetime.date(2023, 9, 10), 5, 10.99, '555-555-5555')
(4, 'Alice Brown', 'Widget A', datetime.date(2023, 9, 13), 7, 10.99, '555-555-5558')
(8, 'Sam White', 'Widget A', datetime.date(2023, 9, 17), 1, 10.99, '555-555-5562')
(12, 'Liam Martin', 'Widget A', datetime.date(2023, 9, 21), 5, 10.99, '555-555-5566')
(16, 'Emma Wilson', 'Widget A', datetime.date(2023, 9, 25), 3, 10.99, '555-555-5570')
(20, 'James Davis', 'Widget A', datetime.date(2023, 9, 29), 2, 10.99, '555-555-5574')
(2, 'Jane Smith', 'Widget B', datetime.date(2023, 9, 11), 3, 15.49, '555-555-5556')
(6, 'David Lee', 'Widget B', datetime.date(2023, 9, 15), 4, 15.49, '555-555-5560')
(10, 'Sophia Harris', 'Widget B', datetime.date(2023, 9, 19), 3, 15.49, '555-555-5564')
(14, 'Ava Garcia', 'Widget B', datetime.date(2023, 9, 23), 4, 15.49, '555-555-5568')
(18, 'Lily Johnson', 'Widget B', datetime.date(2023, 9, 27), 6, 15.49, '555-555-5572')
(5, 'Ella Davis', 'Widget D', datetime.date(2023, 9, 14), 2, 19.99, '555-555-5559')
(9, 'Olivia Turner', 'Widget D', datetime.date(2023, 9, 18), 6, 19.99, '555-555-5563')
(13, 'Mia Turner', 'Widget D', datetime.date(2023, 9, 22), 2, 19.99, '555-555-5567')
(17, 'Oliver Smith', 'Widget D', datetime.date(2023, 9, 26), 5, 19.99, '555-555-5571')

### We will be  adding all the data and storing all the data in a dataframe

In [40]:
from_db=[]
for result in results:
    result =list(result)
    from_db.append(result)
    columns=["order_id","customer_name","product_name","date_ordered","quantity","unit_price","phone_number"]
df=pd.DataFrame(from_db,columns=columns)
display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,3,Bob Johnson,Widget C,2023-09-12,10,8.99,555-555-5557
1,7,Grace Wilson,Widget C,2023-09-16,8,8.99,555-555-5561
2,11,Lucas Clark,Widget C,2023-09-20,9,8.99,555-555-5565
3,15,Noah Jackson,Widget C,2023-09-24,7,8.99,555-555-5569
4,19,Charlotte Brown,Widget C,2023-09-28,4,8.99,555-555-5573
5,1,John Doe,Widget A,2023-09-10,5,10.99,555-555-5555
6,4,Alice Brown,Widget A,2023-09-13,7,10.99,555-555-5558
7,8,Sam White,Widget A,2023-09-17,1,10.99,555-555-5562
8,12,Liam Martin,Widget A,2023-09-21,5,10.99,555-555-5566
9,16,Emma Wilson,Widget A,2023-09-25,3,10.99,555-555-5570
10,20,James Davis,Widget A,2023-09-29,2,10.99,555-555-5574
11,2,Jane Smith,Widget B,2023-09-11,3,15.49,555-555-5556
12,6,David Lee,Widget B,2023-09-15,4,15.49,555-555-5560
13,10,Sophia Harris,Widget B,2023-09-19,3,15.49,555-555-5564
14,14,Ava Garcia,Widget B,2023-09-23,4,15.49,555-555-5568
15,18,Lily Johnson,Widget B,2023-09-27,6,15.49,555-555-5572
16,5,Ella Davis,Widget D,2023-09-14,2,19.99,555-555-5559
17,9,Olivia Turner,Widget D,2023-09-18,6,19.99,555-555-5563
18,13,Mia Turner,Widget D,2023-09-22,2,19.99,555-555-5567
19,17,Oliver Smith,Widget D,2023-09-26,5,19.99,555-555-5571

### UPDATE

In [44]:
update =""" 
update orders
set unit_price=45
where order_id =3
""" 
connection =create_db_connection("localhost","root",pw,db)
execute_query(connection,update)

MySQL database connection was successful
query was succesful

In [45]:
q8=""" 
select * from orders where order_id =3;
""" 
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q8)
for result in results:
    print(result)

MySQL database connection was successful
(3, 'Bob Johnson', 'Widget C', datetime.date(2023, 9, 12), 10, 45.0, '555-555-5557')

### DELETE

In [49]:
delete_order =""" 
delete from orders
where order_id  = 3;
"""
connection =create_db_connection("localhost","root",pw,db)
execute_query(connection,update)

MySQL database connection was successful
query was succesful

In [50]:
q9=""" 
select * from orders ;
""" 
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q9)
for result in results:
    print(result)

MySQL database connection was successful
(1, 'John Doe', 'Widget A', datetime.date(2023, 9, 10), 5, 10.99, '555-555-5555')
(2, 'Jane Smith', 'Widget B', datetime.date(2023, 9, 11), 3, 15.49, '555-555-5556')
(3, 'Bob Johnson', 'Widget C', datetime.date(2023, 9, 12), 10, 45.0, '555-555-5557')
(4, 'Alice Brown', 'Widget A', datetime.date(2023, 9, 13), 7, 10.99, '555-555-5558')
(5, 'Ella Davis', 'Widget D', datetime.date(2023, 9, 14), 2, 19.99, '555-555-5559')
(6, 'David Lee', 'Widget B', datetime.date(2023, 9, 15), 4, 15.49, '555-555-5560')
(7, 'Grace Wilson', 'Widget C', datetime.date(2023, 9, 16), 8, 8.99, '555-555-5561')
(8, 'Sam White', 'Widget A', datetime.date(2023, 9, 17), 1, 10.99, '555-555-5562')
(9, 'Olivia Turner', 'Widget D', datetime.date(2023, 9, 18), 6, 19.99, '555-555-5563')
(10, 'Sophia Harris', 'Widget B', datetime.date(2023, 9, 19), 3, 15.49, '555-555-5564')
(11, 'Lucas Clark', 'Widget C', datetime.date(2023, 9, 20), 9, 8.99, '555-555-5565')
(12, 'Liam Martin', 'Widget A', datetime.date(2023, 9, 21), 5, 10.99, '555-555-5566')
(13, 'Mia Turner', 'Widget D', datetime.date(2023, 9, 22), 2, 19.99, '555-555-5567')
(14, 'Ava Garcia', 'Widget B', datetime.date(2023, 9, 23), 4, 15.49, '555-555-5568')
(15, 'Noah Jackson', 'Widget C', datetime.date(2023, 9, 24), 7, 8.99, '555-555-5569')
(16, 'Emma Wilson', 'Widget A', datetime.date(2023, 9, 25), 3, 10.99, '555-555-5570')
(17, 'Oliver Smith', 'Widget D', datetime.date(2023, 9, 26), 5, 19.99, '555-555-5571')
(18, 'Lily Johnson', 'Widget B', datetime.date(2023, 9, 27), 6, 15.49, '555-555-5572')
(19, 'Charlotte Brown', 'Widget C', datetime.date(2023, 9, 28), 4, 8.99, '555-555-5573')
(20, 'James Davis', 'Widget A', datetime.date(2023, 9, 29), 2, 10.99, '555-555-5574')

### creating subqueries

In [52]:
# the qurey returns items whre the price is above average price
q10 = """
SELECT *
FROM orders
WHERE unit_price > (SELECT AVG(unit_price) FROM orders)
ORDER BY unit_price;
"""
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q10)
for result in results:
    print(result)

MySQL database connection was successful
(2, 'Jane Smith', 'Widget B', datetime.date(2023, 9, 11), 3, 15.49, '555-555-5556')
(6, 'David Lee', 'Widget B', datetime.date(2023, 9, 15), 4, 15.49, '555-555-5560')
(10, 'Sophia Harris', 'Widget B', datetime.date(2023, 9, 19), 3, 15.49, '555-555-5564')
(14, 'Ava Garcia', 'Widget B', datetime.date(2023, 9, 23), 4, 15.49, '555-555-5568')
(18, 'Lily Johnson', 'Widget B', datetime.date(2023, 9, 27), 6, 15.49, '555-555-5572')
(5, 'Ella Davis', 'Widget D', datetime.date(2023, 9, 14), 2, 19.99, '555-555-5559')
(9, 'Olivia Turner', 'Widget D', datetime.date(2023, 9, 18), 6, 19.99, '555-555-5563')
(13, 'Mia Turner', 'Widget D', datetime.date(2023, 9, 22), 2, 19.99, '555-555-5567')
(17, 'Oliver Smith', 'Widget D', datetime.date(2023, 9, 26), 5, 19.99, '555-555-5571')
(3, 'Bob Johnson', 'Widget C', datetime.date(2023, 9, 12), 10, 45.0, '555-555-5557')

### ORDER BY + LIMIT

In [55]:
#This query retrieves the top 10 orders with the highest order quantities and orders them 
#by order quantity in descending order.
q11 = """
SELECT *
FROM orders
ORDER BY quantity DESC
LIMIT 10;
"""
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q11)
for result in results:
    print(result)

MySQL database connection was successful
(3, 'Bob Johnson', 'Widget C', datetime.date(2023, 9, 12), 10, 45.0, '555-555-5557')
(11, 'Lucas Clark', 'Widget C', datetime.date(2023, 9, 20), 9, 8.99, '555-555-5565')
(7, 'Grace Wilson', 'Widget C', datetime.date(2023, 9, 16), 8, 8.99, '555-555-5561')
(4, 'Alice Brown', 'Widget A', datetime.date(2023, 9, 13), 7, 10.99, '555-555-5558')
(15, 'Noah Jackson', 'Widget C', datetime.date(2023, 9, 24), 7, 8.99, '555-555-5569')
(9, 'Olivia Turner', 'Widget D', datetime.date(2023, 9, 18), 6, 19.99, '555-555-5563')
(18, 'Lily Johnson', 'Widget B', datetime.date(2023, 9, 27), 6, 15.49, '555-555-5572')
(1, 'John Doe', 'Widget A', datetime.date(2023, 9, 10), 5, 10.99, '555-555-5555')
(12, 'Liam Martin', 'Widget A', datetime.date(2023, 9, 21), 5, 10.99, '555-555-5566')
(17, 'Oliver Smith', 'Widget D', datetime.date(2023, 9, 26), 5, 19.99, '555-555-5571')

### MAX AND MIN

In [56]:
#This query retrieves orders with the highest and lowest unit prices in your "orders" table.
q12 = """
SELECT *
FROM orders
WHERE unit_price = (SELECT MAX(unit_price) FROM orders)
   OR unit_price = (SELECT MIN(unit_price) FROM orders)
ORDER BY unit_price;
"""
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q12)
for result in results:
    print(result)

MySQL database connection was successful
(7, 'Grace Wilson', 'Widget C', datetime.date(2023, 9, 16), 8, 8.99, '555-555-5561')
(11, 'Lucas Clark', 'Widget C', datetime.date(2023, 9, 20), 9, 8.99, '555-555-5565')
(15, 'Noah Jackson', 'Widget C', datetime.date(2023, 9, 24), 7, 8.99, '555-555-5569')
(19, 'Charlotte Brown', 'Widget C', datetime.date(2023, 9, 28), 4, 8.99, '555-555-5573')
(3, 'Bob Johnson', 'Widget C', datetime.date(2023, 9, 12), 10, 45.0, '555-555-5557')

### ORDER +GROUP BY

In [59]:
#We will be grouping the products by calculating the average units sold and rank them based on avaerage units 
#sold per product
q13=""" 
SELECT product_name, AVG(quantity) AS average_units
FROM orders
GROUP BY product_name
ORDER BY average_units DESC;
""" 
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q13)
for result in results:
    print(result)

MySQL database connection was successful
('Widget C', Decimal('7.6000'))
('Widget B', Decimal('4.0000'))
('Widget A', Decimal('3.8333'))
('Widget D', Decimal('3.7500'))

In [60]:
# We will be grouping the products by calculating th average price per product and  order them
q14=""" 
SELECT product_name, AVG(unit_price) AS price
FROM orders
GROUP BY product_name
ORDER BY price DESC;
""" 
connection=create_db_connection("localhost","root",pw,db)
results=read_query(connection,q14)
for result in results:
    print(result)

MySQL database connection was successful
('Widget D', 19.989999771118164)
('Widget C', 16.19199981689453)
('Widget B', 15.489999771118164)
('Widget A', 10.989999771118164)

#### One thing we can clearly seeis that even if gropu d has a samller number of products sold based on the mean it leads based on price means there is an inverse correlation between the units (products)and the price